---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalysisDisplayDeformedShapeSettings Constructor
AnalysisDisplayDeformedShapeSettings Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | AnalysisDisplayDeformedShapeSettings()()()() | Constructs a default instance of deformed shape settings. |
|  | AnalysisDisplayDeformedShapeSettings(AnalysisDisplayDeformedShapeSettings) | Constructs a new copy of the input AnalysisDisplayDeformedShapeSettings object. |

# See Also

AnalysisDisplayDeformedShapeSettings Class

AnalysisDisplayDeformedShapeSettings Members

Autodesk.Revit.DB.Analysis Namespace